Videos-and-conferences.org
#+INCLUDE: theme/style.org
#+TITLE: CPP / C++ - Videos and Conferences 
#+DESCRIPTION: cpp c++ code examples, demonstrations, design pattern and integration.
#+STARTUP: content 

 - [[wiki:index][Index]]

* Videos and Conferences 
** Fundamentals 
