Videos-and-conferences.org
*** Series - Dive in C++14 (Game Oriented) - Vittorio Romeo

 *Dive into C++11*

 * [[https://www.youtube.com/watch?v=_4K3tsKa1Uc&index=1&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e][Dive into C++11 - <1> - Arkanoid clone in 160~ lines of code (SFML 2.1)]]

 * [[https://www.youtube.com/watch?v=tPbrWAbzyTE&index=2&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e][Dive into C++11 - <2> - Frametime, FPS, constexpr, uniform initialization]]

 * [[https://www.youtube.com/watch?v=0TGp0o1KnG8&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e&index=3][Dive into C++11 - <3> - Automatic lifetime, pointers, dynamic allocation]]

 * [[https://www.youtube.com/watch?v=zMdD-s5_BIY&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e&index=4][Dive into C++11 - <4> - Smart pointers]]

 * [[https://www.youtube.com/watch?v=QAmtgvwHInM&index=6&t=0s&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e][Dive into C++11 - <5> - Game entity management basics]]
   + Entity component system.

 *Dive into C++14*

 * [[https://www.youtube.com/watch?v=WZYKzCsACiw&index=6&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e][Dive into C++14 - <1> - Introduction to C++14 core language features]]
   + Note 1: Contexpr => Can have loops, for-loops and doesn't need to be
     recursive as before. It is useful for computing look-up tables,
     hash, CRC32 and checksums at compile-time.

   + Note 2: Return type deduction => Return type can be omitted.
     However, it can be make the code harder to read.

   + Note 3: Variable templates. Allows computing numerical constats
     at compile-time such as PI with some precision.

   + Note 4:
     + Lambda functions can have _auto_ argument or argument type
       deduction.
     + Lambda functions can have variadic parameter pack.

 * [[https://www.youtube.com/watch?v=Za92Tz_g0zQ&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e&index=7][Dive into C++14 - <2> - `for_each_argument` explained and expanded]]

 * [[https://www.youtube.com/watch?v=Ehdl6j3Ace4&index=8&list=PLTEcWGdSiQenl4YRPvSqW7UPC6SiGNN7e][Dive into C++14 - <3> - Generic "unique resource" wrapper]]

** Misc 
*** Bjarne Stroustrup - The Essence of C++

- [[https://www.youtube.com/watch?v=86xWVb4XIyE][Bjarne Stroustrup - The Essence of C++]]
  - "Bjarne Stroustrup, creator and developer of C++, delivers his
    talk entitled, The Essence of C++. Stroustrup has held
    distinguished posts at Texas A&M University and spent significant
    time in the Computer Science Departments of Cambridge, Columbia
    and Princeton. C++ is the one of the world's most widely used
    technology languages and it has influenced newer languages such
    as C# and Java as well as older languages."
    + Applications on System Programming Domains:
      - Device drivers
      - Network drivers
      - Embedded Systems
      - Suitable for hard and soft real time systems.
    + C++ Origin: C + Simula (First Object Oriented language)
    + Main Ideas:
      - Direct map to hardware
      - Zero-overhead abstraction
      - Much of inspiration comes from operating systems.
      - Backward compatibility: Avoid breaking old code.
    + Key strengths:
      + A language for building lightweight abstractions.
      + Software infrastructure.
      + Resource-constrained application. (May be embedded systems)
      + Resource Management
*** CppCon 2017: Michael Spencer "My Little Object File: How Linkers Implement C++"

 - [[https://www.youtube.com/watch?v=a5L66zguFe4][CppCon 2017: Michael Spencer “My Little Object File: How Linkers Implement C++” - YouTube]]
   - "Ever wonder how the linker turns your compiled C++ code into an
     executable file? Why the One Definition Rule exists? Or why your
     debug builds are so large? In this talk we'll take a deep dive
     and follow the story of our three adventurers, ELF, MachO, and
     COFF as they make their way out of Objectville carrying C++
     translation units on their backs as they venture to become
     executables. We'll see as they make their way through the tangled
     forests of name mangling, climb the cliffs of thread local
     storage, and wade through the bogs of debug info. We'll see how
     they mostly follow the same path, but each approach the journey
     in their own way.  We'll also see that becoming an executable is
     not quite the end of their journey, as the dynamic linker awaits
     to bring them to yet a higher plane of existence as complete C++
     programs running on a machine."
*** C++NOW 2018: Michael Caisse - Modern C++ in Embedded Systems 

 + [[https://www.youtube.com/watch?v=1l2g2dAobXA][Modern C++ in Embedded Systems - YouTube]]
   + "For nearly 35 years I have been working with small processors
     and there has always been deep divides between practitioners of
     languages. When writing assembly we ridiculed those using C and
     when I spent years microcoding we scoffed at everyone. However,
     nearly all groups continue to wag their heads at the shameful C++
     programmers attempting to twist their tools toward the
     small. Recent language developments have made C++ the obvious
     choice for many embedded projects; nevertheless, the toxic
     environment extends past reddit roasts into poor vendor support
     of tools and nearly obstructionist chip manufacturers. This
     session will use a bare-metal project started in 2018 for a Ciere
     client as a case study while we work through the decision process
     for using C++, the acrobatics required to support the language,
     recent language features that enable goals of size, speed, and
     expressiveness, and useful libraries. While the examples will be
     based on a concrete project, the extracted lessons-learned should
     be applicable to many embedded projects (bare-metal and
     small-OS). Attendees will walk away with motivations to use C++
     in embedded projects, hints and tips to making tools work, and a
     sampling of language features and idioms that improve the quality
     of a final product."


See: https://arobenko.gitbooks.io/bare_metal_cpp/content/


What is shown:

   + Case presented: An ARM-based embedded processor is used for
     controlling motors and a hydraulic machine. 

   + Processor used: ARM Cortex RC4 connected to a FPGA (Filed
     Programmable Gate Array).

   + Peripherals mentioned: I2C, SPI

   + Tooling:
     + GCC toolchain for ARM
     + CMAKE for build automation.
     + Linker script

   + State Machine => Boost.SML (https://youtu.be/1l2g2dAobXA?t=4335)
     + Typical state machines used: _Mealy's state_ machine.
     + https://github.com/boost-experimental/sml

   + LADON - Real time object oriented modelling from 90's (prodecessor for
     UML Real time extensions) => Distributed State Machines.
     + Allows to connect multiple state machines.

   + Metaprogramming techniques used:
     + tag dispatching
     + CRTP => Curious Recurring Template Pattern for emulating
       dynamic polymorphism (runtime poly.) with static polymorphism
       at compile time.
     + Mixins
     + Variant Polymorphism
     + Type traits (metafunctions) => struct which takes list of types
       as arguments peforming computations on types.
     + Type synonyms with 'using' keyword

   + Common compiler options disabled on code for embedded systems:
     + Disable RTTI (-fno-rtti)
     + Disable exceptions (-fno-exceptions)

   + How can C++ simplify the project?
     + More declarative.
     + More correctness and bugs caught at compile-time.
     + Template metaprogramming is crucial for developing lightweight
       abstraction and reducing run-time overhead.

** Type Erasure and Polymorphism
