Videos-and-conferences.html


<div id="outline-container-org9c34abd" class="outline-3">
<h3 id="org9c34abd"><span class="section-number-3">1.2</span> Misc</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc96720d" class="outline-4">
<h4 id="orgc96720d"><span class="section-number-4">1.2.1</span> Bjarne Stroustrup - The Essence of C++</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=86xWVb4XIyE">Bjarne Stroustrup - The Essence of C++</a>
<ul class="org-ul">
<li>"Bjarne Stroustrup, creator and developer of C++, delivers his
talk entitled, The Essence of C++. Stroustrup has held
distinguished posts at Texas A&amp;M University and spent significant
time in the Computer Science Departments of Cambridge, Columbia
and Princeton. C++ is the one of the world's most widely used
technology languages and it has influenced newer languages such
as C# and Java as well as older languages."
<ul class="org-ul">
<li>Applications on System Programming Domains:
<ul class="org-ul">
<li>Device drivers</li>
<li>Network drivers</li>
<li>Embedded Systems</li>
<li>Suitable for hard and soft real time systems.</li>
</ul></li>
<li>C++ Origin: C + Simula (First Object Oriented language)</li>
<li>Main Ideas:
<ul class="org-ul">
<li>Direct map to hardware</li>
<li>Zero-overhead abstraction</li>
<li>Much of inspiration comes from operating systems.</li>
<li>Backward compatibility: Avoid breaking old code.</li>
</ul></li>
<li>Key strengths:
<ul class="org-ul">
<li>A language for building lightweight abstractions.</li>
<li>Software infrastructure.</li>
<li>Resource-constrained application. (May be embedded systems)</li>
<li>Resource Management</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0de164c" class="outline-4">
<h4 id="org0de164c"><span class="section-number-4">1.2.2</span> CppCon 2017: Michael Spencer "My Little Object File: How Linkers Implement C++"</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=a5L66zguFe4">CppCon 2017: Michael Spencer “My Little Object File: How Linkers Implement C++” - YouTube</a>
<ul class="org-ul">
<li>"Ever wonder how the linker turns your compiled C++ code into an
executable file? Why the One Definition Rule exists? Or why your
debug builds are so large? In this talk we'll take a deep dive
and follow the story of our three adventurers, ELF, MachO, and
COFF as they make their way out of Objectville carrying C++
translation units on their backs as they venture to become
executables. We'll see as they make their way through the tangled
forests of name mangling, climb the cliffs of thread local
storage, and wade through the bogs of debug info. We'll see how
they mostly follow the same path, but each approach the journey
in their own way.  We'll also see that becoming an executable is
not quite the end of their journey, as the dynamic linker awaits
to bring them to yet a higher plane of existence as complete C++
programs running on a machine."</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3af1144" class="outline-4">
<h4 id="org3af1144"><span class="section-number-4">1.2.3</span> C++NOW 2018: Michael Caisse - Modern C++ in Embedded Systems</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=1l2g2dAobXA">Modern C++ in Embedded Systems - YouTube</a>
<ul class="org-ul">
<li>"For nearly 35 years I have been working with small processors
and there has always been deep divides between practitioners of
languages. When writing assembly we ridiculed those using C and
when I spent years microcoding we scoffed at everyone. However,
nearly all groups continue to wag their heads at the shameful C++
programmers attempting to twist their tools toward the
small. Recent language developments have made C++ the obvious
choice for many embedded projects; nevertheless, the toxic
environment extends past reddit roasts into poor vendor support
of tools and nearly obstructionist chip manufacturers. This
session will use a bare-metal project started in 2018 for a Ciere
client as a case study while we work through the decision process
for using C++, the acrobatics required to support the language,
recent language features that enable goals of size, speed, and
expressiveness, and useful libraries. While the examples will be
based on a concrete project, the extracted lessons-learned should
be applicable to many embedded projects (bare-metal and
small-OS). Attendees will walk away with motivations to use C++
in embedded projects, hints and tips to making tools work, and a
sampling of language features and idioms that improve the quality
of a final product."</li>
</ul></li>
</ul>


<p>
See: <a href="https://arobenko.gitbooks.io/bare_metal_cpp/content/">https://arobenko.gitbooks.io/bare_metal_cpp/content/</a>
</p>


<p>
What is shown:
</p>

<ul class="org-ul">
<li>Case presented: An ARM-based embedded processor is used for
controlling motors and a hydraulic machine.</li>

<li>Processor used: ARM Cortex RC4 connected to a FPGA (Filed
Programmable Gate Array).</li>

<li>Peripherals mentioned: I2C, SPI</li>

<li>Tooling:
<ul class="org-ul">
<li>GCC toolchain for ARM</li>
<li>CMAKE for build automation.</li>
<li>Linker script</li>
</ul></li>

<li>State Machine =&gt; Boost.SML (<a href="https://youtu.be/1l2g2dAobXA?t=4335">https://youtu.be/1l2g2dAobXA?t=4335</a>)
<ul class="org-ul">
<li>Typical state machines used: <span class="underline">Mealy's state</span> machine.</li>
<li><a href="https://github.com/boost-experimental/sml">https://github.com/boost-experimental/sml</a></li>
</ul></li>

<li>LADON - Real time object oriented modelling from 90's (prodecessor for
UML Real time extensions) =&gt; Distributed State Machines.
<ul class="org-ul">
<li>Allows to connect multiple state machines.</li>
</ul></li>

<li>Metaprogramming techniques used:
<ul class="org-ul">
<li>tag dispatching</li>
<li>CRTP =&gt; Curious Recurring Template Pattern for emulating
dynamic polymorphism (runtime poly.) with static polymorphism
at compile time.</li>
<li>Mixins</li>
<li>Variant Polymorphism</li>
<li>Type traits (metafunctions) =&gt; struct which takes list of types
as arguments peforming computations on types.</li>
<li>Type synonyms with 'using' keyword</li>
</ul></li>

<li>Common compiler options disabled on code for embedded systems:
<ul class="org-ul">
<li>Disable RTTI (-fno-rtti)</li>
<li>Disable exceptions (-fno-exceptions)</li>
</ul></li>

<li>How can C++ simplify the project?
<ul class="org-ul">
<li>More declarative.</li>
<li>More correctness and bugs caught at compile-time.</li>
<li>Template metaprogramming is crucial for developing lightweight
abstraction and reducing run-time overhead.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7da0ba0" class="outline-3">
<h3 id="org7da0ba0"><span class="section-number-3">1.3</span> Type Erasure and Polymorphism</h3>
<div class="outline-text-3" id="text-1-3">
</div>
