Videos-and-conferences.org
*** NDC Conference 2017 - Sean Parent -  Better Code: Runtime Polymorphism

 + [[https://www.youtube.com/watch?v=QGcVXgEVMJg][Better Code: Runtime Polymorphism - Sean Parent - YouTube]]

   + Description: "This talk explains why (and how) to implement
     polymorphism without inheritance in C++. The talk contains many
     C++ tips and techniques, including many new features from
     C++11. During the course of that talk a key feature from
     Photoshop will be demonstrated and implemented."

   + Notes: This talk is about how to preserve value semantics and
     polymorphism without using inheritance in the client code. It is
     done by using the *type erasure* design pattern. Actually, the
     solution presented do use inheritance, but inside the ~object_t~
     class.

   + Benefits of the presented *type erasure* implementation:

     + Greater interoperability between software components as classes
       doesn't need to inherit froms same base class, the only
       requirement is to satisfy the constructor template constraints.

     + Alows value semantics to cohexist with polymorphism with
       minimal performance penalty. It combines the benefits of
       dynamic and static polymorphism.

     + A factory function can return a value rather than a pointer or
       smart pointer and still preserve the value semantics.

     + Non-intrusive for client code. A client code doesn't need to be
       aware of polymorphism. For instance, a client code _double describeArea(const Shape& sh)_ 
       cannot be used directly with objects returned by a factory
       function, for instance   std::unique_ptr<Shape>. By using 
       type erasure, this code  doesn't need to modified as the
       factory function can returns a value instead of a pointer and 
       still preserve the polymorphism.
       + Less error prone
       + Client code doesn't need heap allocation. (Actually, the heap
         allocation is hidden in the type erasure wrapper)
       + The client code doesn't need to worry about object ownership
         or lifetime.
       + Exception safe
       + Thread safe

     + _Referenced Book_: Stepanov, Alexander and Paul McJones -
       *Elements of Programming* - Addison Wesley - Professional 2009. 

   + Key Moments 

     + https://youtu.be/QGcVXgEVMJg?t=2032
       + The class structure is composed by concept class (interface),
         model classes inheriting the concept and the outter class
         that hides the inheritance and wraps any argument which
         statifies the template constraints.

     + https://youtu.be/QGcVXgEVMJg?t=2072
       + A virtual copy constructor is used in the concept class for
         allowing the wrapper class (outer class) object_t to preserve
         copy semantics by performing deep copying, instead of shallow
         copying.

     + https://youtu.be/QGcVXgEVMJg?t=2136 and https://youtu.be/QGcVXgEVMJg?t=2156
       + Templates used at constructor and the model. 
         
*** C++Now 2018: Louis Dionne "Runtime Polymorphism: Back to the Basics"

- [[https://www.youtube.com/watch?v=OtU51Ytfe04][C++Now 2018: Louis Dionne “Runtime Polymorphism: Back to the Basics” - YouTube]]
  + Description: "C++ solves the problem of runtime polymorphism in a very
    specific way. It does so through inheritance, by having all
    classes that will be used polymorphically inherit from the same
    base class, and then using a table of function pointers (the
    virtual table) to perform dynamic dispatch when a method is
    called. Polymorphic objects are then accessed through pointers to
    their base class, which encourages storing objects on the heap
    and accessing them via pointers. This is both inconvenient and
    inefficient when compared to traditional value semantics. As Sean
    Parent said: Inheritance is the base class of evil. It turns out
    that this is only one of many possible designs, each of which has
    different tradeoffs and characteristics. This talk will explore
    the design space for runtime polymorphism in C++, and in
    particular will introduce a policy-based approach to solving the
    problem. We will see how this approach enables runtime
    polymorphism with stack-allocated storage, heap-allocated
    storage, shared storage, no storage at all (reference semantics),
    and more. We will also see how we can get fine-grained control
    over the dispatch mechanism to beat the performance of classic
    virtual tables in some cases. The examples will be based on a
    real implementation in the Dyno library [1], but the principles
    are independent from the library."

    + Problem: C++ sub-typing polymorphism inevitably requires
      pointers to objects allocated on the heap. However by using
      pointers, the advantages of value semantics, which C++ is built
      on top, are lost. For instance, pointers doesn't play well with
      C++ algorithms and functions expecting value or reference
      parameters. Another issue is that pointers to objects allocated
      on the heap raises questions about memory ownership such as who
      should delete the pointer.

      + Ideas => some possible approaches:
        + Use static polymorphism: _template functions._
        + Use a _proxy object allocated on the stack._ The object
          inherits the base class and takes a pointer to base class
          as argument. Then the proxy object can forward any method
          call or message to the wrapped heap object.
        + Deal with it and accept as it is for performance reasons.

*** ECOOP 2015 - Bjarne Stroustrup - Object Oriented Programming without Inheritance 
 
 + [[https://www.youtube.com/watch?v=xcpSLRpOMJM][Bjarne Stroustrup - Object Oriented Programming without Inheritance - ECOOP 2015 - YouTube]]
   + Explanative talk about generic programming (templates) paradigm
     as an alternative to object oriented programming inheritance.
   + Selected Moments:
     + [[https://youtu.be/xcpSLRpOMJM?t=619][Deep Roots in earliste C++]]
     + [[https://youtu.be/xcpSLRpOMJM?t=794][Resources and resources management]]
     + [[https://youtu.be/xcpSLRpOMJM?t=1044][Move Semantics]]
     + [[https://youtu.be/xcpSLRpOMJM?t=1249][Generic Programming in C++]]
     + [[https://youtu.be/xcpSLRpOMJM?t=1566][An Example of generic interface]]
     + [[https://youtu.be/xcpSLRpOMJM?t=2088][C++ 'concepts']] (Generic programming.)

