Videos-and-conferences.html
<div id="outline-container-org73ca501" class="outline-4">
<h4 id="org73ca501"><span class="section-number-4">1.3.1</span> NDC Conference 2017 - Sean Parent -  Better Code: Runtime Polymorphism</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=QGcVXgEVMJg">Better Code: Runtime Polymorphism - Sean Parent - YouTube</a>

<ul class="org-ul">
<li>Description: "This talk explains why (and how) to implement
polymorphism without inheritance in C++. The talk contains many
C++ tips and techniques, including many new features from
C++11. During the course of that talk a key feature from
Photoshop will be demonstrated and implemented."</li>

<li>Notes: This talk is about how to preserve value semantics and
polymorphism without using inheritance in the client code. It is
done by using the <b>type erasure</b> design pattern. Actually, the
solution presented do use inheritance, but inside the <code>object_t</code>
class.</li>

<li>Benefits of the presented <b>type erasure</b> implementation:

<ul class="org-ul">
<li>Greater interoperability between software components as classes
doesn't need to inherit froms same base class, the only
requirement is to satisfy the constructor template constraints.</li>

<li>Alows value semantics to cohexist with polymorphism with
minimal performance penalty. It combines the benefits of
dynamic and static polymorphism.</li>

<li>A factory function can return a value rather than a pointer or
smart pointer and still preserve the value semantics.</li>

<li>Non-intrusive for client code. A client code doesn't need to be
aware of polymorphism. For instance, a client code <span class="underline">double describeArea(const Shape&amp; sh)</span> 
cannot be used directly with objects returned by a factory
function, for instance   std::unique_ptr&lt;Shape&gt;. By using 
type erasure, this code  doesn't need to modified as the
factory function can returns a value instead of a pointer and 
still preserve the polymorphism.
<ul class="org-ul">
<li>Less error prone</li>
<li>Client code doesn't need heap allocation. (Actually, the heap
allocation is hidden in the type erasure wrapper)</li>
<li>The client code doesn't need to worry about object ownership
or lifetime.</li>
<li>Exception safe</li>
<li>Thread safe</li>
</ul></li>

<li><span class="underline">Referenced Book</span>: Stepanov, Alexander and Paul McJones -
<b>Elements of Programming</b> - Addison Wesley - Professional 2009.</li>
</ul></li>

<li>Key Moments 

<ul class="org-ul">
<li><a href="https://youtu.be/QGcVXgEVMJg?t=2032">https://youtu.be/QGcVXgEVMJg?t=2032</a>
<ul class="org-ul">
<li>The class structure is composed by concept class (interface),
model classes inheriting the concept and the outter class
that hides the inheritance and wraps any argument which
statifies the template constraints.</li>
</ul></li>

<li><a href="https://youtu.be/QGcVXgEVMJg?t=2072">https://youtu.be/QGcVXgEVMJg?t=2072</a>
<ul class="org-ul">
<li>A virtual copy constructor is used in the concept class for
allowing the wrapper class (outer class) object_t to preserve
copy semantics by performing deep copying, instead of shallow
copying.</li>
</ul></li>

<li><a href="https://youtu.be/QGcVXgEVMJg?t=2136">https://youtu.be/QGcVXgEVMJg?t=2136</a> and <a href="https://youtu.be/QGcVXgEVMJg?t=2156">https://youtu.be/QGcVXgEVMJg?t=2156</a>
<ul class="org-ul">
<li>Templates used at constructor and the model.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga70e5e1" class="outline-4">
<h4 id="orga70e5e1"><span class="section-number-4">1.3.2</span> C++Now 2018: Louis Dionne "Runtime Polymorphism: Back to the Basics"</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=OtU51Ytfe04">C++Now 2018: Louis Dionne “Runtime Polymorphism: Back to the Basics” - YouTube</a>
<ul class="org-ul">
<li>Description: "C++ solves the problem of runtime polymorphism in a very
specific way. It does so through inheritance, by having all
classes that will be used polymorphically inherit from the same
base class, and then using a table of function pointers (the
virtual table) to perform dynamic dispatch when a method is
called. Polymorphic objects are then accessed through pointers to
their base class, which encourages storing objects on the heap
and accessing them via pointers. This is both inconvenient and
inefficient when compared to traditional value semantics. As Sean
Parent said: Inheritance is the base class of evil. It turns out
that this is only one of many possible designs, each of which has
different tradeoffs and characteristics. This talk will explore
the design space for runtime polymorphism in C++, and in
particular will introduce a policy-based approach to solving the
problem. We will see how this approach enables runtime
polymorphism with stack-allocated storage, heap-allocated
storage, shared storage, no storage at all (reference semantics),
and more. We will also see how we can get fine-grained control
over the dispatch mechanism to beat the performance of classic
virtual tables in some cases. The examples will be based on a
real implementation in the Dyno library [1], but the principles
are independent from the library."

<ul class="org-ul">
<li>Problem: C++ sub-typing polymorphism inevitably requires
pointers to objects allocated on the heap. However by using
pointers, the advantages of value semantics, which C++ is built
on top, are lost. For instance, pointers doesn't play well with
C++ algorithms and functions expecting value or reference
parameters. Another issue is that pointers to objects allocated
on the heap raises questions about memory ownership such as who
should delete the pointer.

<ul class="org-ul">
<li>Ideas =&gt; some possible approaches:
<ul class="org-ul">
<li>Use static polymorphism: <span class="underline">template functions.</span></li>
<li>Use a <span class="underline">proxy object allocated on the stack.</span> The object
inherits the base class and takes a pointer to base class
as argument. Then the proxy object can forward any method
call or message to the wrapped heap object.</li>
<li>Deal with it and accept as it is for performance reasons.</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbf69ef1" class="outline-4">
<h4 id="orgbf69ef1"><span class="section-number-4">1.3.3</span> ECOOP 2015 - Bjarne Stroustrup - Object Oriented Programming without Inheritance</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=xcpSLRpOMJM">Bjarne Stroustrup - Object Oriented Programming without Inheritance - ECOOP 2015 - YouTube</a>
<ul class="org-ul">
<li>Explanative talk about generic programming (templates) paradigm
as an alternative to object oriented programming inheritance.</li>
<li>Selected Moments:
<ul class="org-ul">
<li><a href="https://youtu.be/xcpSLRpOMJM?t=619">Deep Roots in earliste C++</a></li>
<li><a href="https://youtu.be/xcpSLRpOMJM?t=794">Resources and resources management</a></li>
<li><a href="https://youtu.be/xcpSLRpOMJM?t=1044">Move Semantics</a></li>
<li><a href="https://youtu.be/xcpSLRpOMJM?t=1249">Generic Programming in C++</a></li>
<li><a href="https://youtu.be/xcpSLRpOMJM?t=1566">An Example of generic interface</a></li>
<li><a href="https://youtu.be/xcpSLRpOMJM?t=2088">C++ 'concepts'</a> (Generic programming.)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
