Videos-and-conferences.org
*** C++Now 2018: Odin Holmes C++ Mixins: Customization Through Compile Time Composition

 + [[https://www.youtube.com/watch?v=wWZi_wPyVvs][C++Now 2018: Odin Holmes “C++ Mixins: Customization Through Compile Time Composition” - YouTube]]
   + " Working in the embedded domain where 'special cases' are the
     norm I often find myself fighting with customization capabilities
     and 'canned' (non-customizable) abstractions. std::string often
     has a small buffer for small string optimization, std::function
     has something similar, why can't I set the size of that buffer,
     or more radically why can't I just stick that same buffer in a
     std::vector for a 'small vector optimization'. While we're at it
     why can't I take .at() out of std::vectors public interface and
     call some user-defined function on out of memory, maybe I turned
     off exceptions but still want to handle errors properly. Maybe I
     want a std::deque interface but have a fixed sized ring buffer
     under the hood. Those following the SG14 will notice I am ticking
     off proposals, the problem with these proposals is that the
     mostly follow a common pattern: "I need X without Y" or "I need X
     to have Y" and there are many many combinations of X and Y. Why
     do I have to pay for atomic ref counting in a shared_pointer in a
     single threaded use case? We could go on all day. In this talk we
     will explore the feasibility of building classes from composable
     pieces, some concrete proof of concepts as well as the library
     infrastructure needed for this task." 

** Functional Programming 
*** CppCon 2015: Stephan T. Lavavej "functional: What's New, And Proper Usage"

 + [[https://www.youtube.com/watch?v=zt7ThwVfap0][CppCon 2015: Stephan T. Lavavej “functional: What's New, And Proper Usage" - YouTube]]
   + "functional gained lots of machinery in C++11, with further
     changes in C++14 and C++17. This talk will cover what's new in
     11/14/17, focusing on how to use it properly. For example, you've
     probably used std::function, but do you know the criteria for
     activating the Small Functor Optimization? (It's not just being
     small!) We'll also look at bind(), mem_fn(), C++17's invoke(),
     and more." 

 *C++11 Lambdas Expressions*

 + Lambda expressions are core language features. They aren't ordinary
   functions or functions. Actually, lambdas are a special type of
   function-object, Functor generated by the compiler. The compiler
   converts lambda expressions into unnamed classes.

   + A lambda is just a class with member function:
     UnammedClass::operator()(Arguments ...)

 + Lambdas are not std::function. This type is polymorphic type which
   works with function-objects (aka callable objects or "functors")
   and ordinary function pointers.

 *Terminology of C++ ISO Standard*

 _Function-Object_: Anything that can be used or called like a function: 

  + Function pointers
  + Classes with operator()(Args),
  + C++11 Lambdas
  + Reference to functions (also called like a function, but the
    stdandard does not regard it as an object type)

 *C++17 std::invoke()* 

 + => Allows to call anything callable, namely:
   + function pointers
   + function objects 
   + pointers to member functions (PMFs): (obj.* pmf)(arg)
   + pointers to data member (PMDs): obj.*pmd

 _std::invoke_ provides an uniform syntax for invoking all callable
'objects' in C++.

Invoke is particurlarly useful for implementing "higher order
functions" with templates: 

#+BEGIN_SRC cpp
  #include <iostream>
  #include <functional>

  template<typename Range, typename Callable> 
  void transform_print(const Range& range, Callable fobj)
  {
     for(const auto& x : range)
        std::cout << std::invoke(fobj, x) << std::endl;
  }

  [cling]$ auto xs = std::vector<std::string>{"hello", "world", "c++17"};

  [cling]$ xs
  { "hello", "world", "c++17" }

  // Pass a member fucntion 
  [cling]$ transform_print(xs, &std::string::size);
  5
  5
  5

#+END_SRC

 *C++11 std::bind()*  

#+BEGIN_SRC cpp 
  #include <vector>
  #include <algorithm>
  #include <functional> 
  using namespace std::placeholders;

  std::vector<int> vs{1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144};

  // Count the number of elements less than 25 
  >> std::cout << "cout = " << std::count_if(vs.begin(), vs.end(), 
                                             std::bind(std::less<int>(), _1, 25)) 
                            << std::endl;
  cout = 4
  >> 

 >> auto fn = std::bind(std::less<int>(), _1, 25)

 >> fn(10)
 (bool) true
 >> fn(100)
 (bool) false
 >> fn(5)
 (bool) true
 >> fn(24)
 (bool) true
 >> fn(25)
 (bool) false
 >> 
#+END_SRC

 *Reference wrapper class definition* 

#+BEGIN_SRC cpp 
  template<typename T> class reference_wrapper
  { 
  public: 
    typedef T type;
    reference_wrapper(T&)  noexcept;
    reference_wrapper(T&&) = delete;
    reference_wrapper T&() const noexcept;
    T& get() const noexcept;

    template<typename... Args>
     std::result_of_t<T& (Args&&...)>
     operator()(Args&&...) const;
  };
#+END_SRC

 *Recommendations* 

 + Never use the old <functiona> stuff such as mem_fn
 + Remove any existing usage
 + C++98/03 algorithms/containers never needed unary_function /
   binary_function, ptr_fun() [DEPRECATED, DISCONTINUED]
 + Also remove: auto_ptr

 *std::function* 

 + function<Ret (Args) is a wrapper
   + stores a callable ob ject of abitrary type
   + tempalted on call signature, not callable object type
   + type erasure, powered by virtual functions (or equivalent)
   + Useful when code cannot be templated
     + Separately compiled code
     + Virtual function
     + Container elements
   + Requires copy-constructible function objects  

#+BEGIN_SRC cpp 
  using Function = std::function<double (double)>;
  using namespace std::placeholders;
 
  using std::bind;
  using std::plus;
  using std::multiplies;

  auto funlist = std::deque<Function>{};

  funlist.emplace_back(std::bind(plus<double>(), _1, 10))
  funlist.emplace_back(std::bind(multiplies<double>(), _1, 3))
  funlist.emplace_back((double (*) (double)) std::sin )
  funlist.emplace_back((double (*) (double)) std::cos )
  funlist.emplace_back((double (*) (double)) std::exp )
  funlist.emplace_back([](double x){ return 4 * x + 5;} )

  >> funlist
  { @0x2f27b50, @0x2f27b70, @0x2f27b90, @0x2f27bb0, @0x2f27bd0 }
  >> 

  >> for(const auto& fn: funlist){ std::cout << " => " << fn(4.0) << std::endl; }
   => 14
   => 12
   => -0.756802
   => -0.653644
   => 54.5982
   => 21

 #+END_SRC













 
  
*** CPPCON-2017: Klaus Iglberger - Free Your Functions

+ [[https://www.youtube.com/watch?v=WLDT1lDOsb4][CppCon 2017: Klaus Iglberger "Free Your Functions!"]]
  * Description: "You are devoted to minimize coupling and
    duplication? You are taking care to maximize cohesion,
    flexibility, extensibility, encapsulation, testability, and even
    performance in order to achieve the high goals of
    (object-oriented) programming? Awesome!  But wait: You still
    favor member functions? Seriously? You have been deceived! You
    have been praying at the altar of false promises! Shed the
    shackles of Java philosophy! Free your functions!. In this talk I
    will demonstrate why in C++ free functions should generally be
    preferred to member functions, and why free functions — not
    member functions! — provide you with all the aforementioned
    advantages you expect from object-oriented programming. Note,
    though, that this talk might fundamentally change your perception
    of C++ and object-oriented programming in general!"

  * _Summary and notes_:
    * _Free functions_ (ordinary functions or non-virtual functions)
      abides to object oriented principles such as OCP (Open-Close
      Principle) as they can extend a class without requiring
      modification or recompilation of the class source code.
    * _Static polymorphism_ which is a combination of free functions
      and _template metaprogramming_ can make the code more loosely
      coupled and more perfomant.
      * Becomes more loosely coupled because it doesn't require that
        arguments have any common base class or class hierarchy.
      * Becomes more performant as template generates overloaded code
        for each different type parameters combination what
        eliminates virtual function calls and dynamic
        polymorphism. The disadvantage of templates are the higher
        complexity and larger code size.
    * Benefits of Free Functions:
      - Encapsulation
      - Cohesion (SRP - Single Responsibility Principle)
      - Reuse (DRY - DO NOT REPEAT YOURSELF)
      - Overloading (Polymorphism )
      - Generic Programming (Aka template metaprogramming)
      - Abstraction
      - Testability
      - _Performance_ (Raison d'être of C++).

    * Free Functions on standard library:
      - std::begin, std::cbegin ...

    * Use free functions in order to:
      * ... wrap virtual function calls
      * ... get an homogeneous interface.
      * ... get more performant code.
      * ... more flexible and loosely-coupled code.

    * Free functions aren't are multi-paradigm, they can work with
      any paradigm. It is not necessarly functional programming. 

    * Potential Problems
      * C++ doens't have a convenient syntax for function application
        as ML-based languages like Haskell and OCaml. So, multiple
        function applications would be written as f1(f2(f3(f5 ... fn(x))))

      * _Discoverability_: according to the presentation, IDE's may not
        help to find them easily as they help to find methods (aka
        member functions). However it can mitigated with careful
        selection of namespaces which would improve code complexion
        and discoverability.
