Videos-and-conferences.html

<div id="outline-container-org33b0d19" class="outline-4">
<h4 id="org33b0d19"><span class="section-number-4">1.3.4</span> C++Now 2018: Odin Holmes C++ Mixins: Customization Through Compile Time Composition</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=wWZi_wPyVvs">C++Now 2018: Odin Holmes “C++ Mixins: Customization Through Compile Time Composition” - YouTube</a>
<ul class="org-ul">
<li>" Working in the embedded domain where 'special cases' are the
norm I often find myself fighting with customization capabilities
and 'canned' (non-customizable) abstractions. std::string often
has a small buffer for small string optimization, std::function
has something similar, why can't I set the size of that buffer,
or more radically why can't I just stick that same buffer in a
std::vector for a 'small vector optimization'. While we're at it
why can't I take .at() out of std::vectors public interface and
call some user-defined function on out of memory, maybe I turned
off exceptions but still want to handle errors properly. Maybe I
want a std::deque interface but have a fixed sized ring buffer
under the hood. Those following the SG14 will notice I am ticking
off proposals, the problem with these proposals is that the
mostly follow a common pattern: "I need X without Y" or "I need X
to have Y" and there are many many combinations of X and Y. Why
do I have to pay for atomic ref counting in a shared_pointer in a
single threaded use case? We could go on all day. In this talk we
will explore the feasibility of building classes from composable
pieces, some concrete proof of concepts as well as the library
infrastructure needed for this task."</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org790de5d" class="outline-3">
<h3 id="org790de5d"><span class="section-number-3">1.4</span> Functional Programming</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgb4545ff" class="outline-4">
<h4 id="orgb4545ff"><span class="section-number-4">1.4.1</span> CPPCON-2017: Klaus Iglberger - Free Your Functions</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=WLDT1lDOsb4">CppCon 2017: Klaus Iglberger "Free Your Functions!"</a>
<ul class="org-ul">
<li>Description: "You are devoted to minimize coupling and
duplication? You are taking care to maximize cohesion,
flexibility, extensibility, encapsulation, testability, and even
performance in order to achieve the high goals of
(object-oriented) programming? Awesome!  But wait: You still
favor member functions? Seriously? You have been deceived! You
have been praying at the altar of false promises! Shed the
shackles of Java philosophy! Free your functions!. In this talk I
will demonstrate why in C++ free functions should generally be
preferred to member functions, and why free functions — not
member functions! — provide you with all the aforementioned
advantages you expect from object-oriented programming. Note,
though, that this talk might fundamentally change your perception
of C++ and object-oriented programming in general!"</li>

<li><span class="underline">Summary and notes</span>:
<ul class="org-ul">
<li><span class="underline">Free functions</span> (ordinary functions or non-virtual functions)
abides to object oriented principles such as OCP (Open-Close
Principle) as they can extend a class without requiring
modification or recompilation of the class source code.</li>
<li><span class="underline">Static polymorphism</span> which is a combination of free functions
and <span class="underline">template metaprogramming</span> can make the code more loosely
coupled and more perfomant.
<ul class="org-ul">
<li>Becomes more loosely coupled because it doesn't require that
arguments have any common base class or class hierarchy.</li>
<li>Becomes more performant as template generates overloaded code
for each different type parameters combination what
eliminates virtual function calls and dynamic
polymorphism. The disadvantage of templates are the higher
complexity and larger code size.</li>
</ul></li>
<li>Benefits of Free Functions:
<ul class="org-ul">
<li>Encapsulation</li>
<li>Cohesion (SRP - Single Responsibility Principle)</li>
<li>Reuse (DRY - DO NOT REPEAT YOURSELF)</li>
<li>Overloading (Polymorphism )</li>
<li>Generic Programming (Aka template metaprogramming)</li>
<li>Abstraction</li>
<li>Testability</li>
<li><span class="underline">Performance</span> (Raison d'être of C++).</li>
</ul></li>

<li>Free Functions on standard library:
<ul class="org-ul">
<li>std::begin, std::cbegin &#x2026;</li>
</ul></li>

<li>Use free functions in order to:
<ul class="org-ul">
<li>&#x2026; wrap virtual function calls</li>
<li>&#x2026; get an homogeneous interface.</li>
<li>&#x2026; get more performant code.</li>
<li>&#x2026; more flexible and loosely-coupled code.</li>
</ul></li>

<li>Free functions aren't are multi-paradigm, they can work with
any paradigm. It is not necessarly functional programming.</li>

<li>Potential Problems
<ul class="org-ul">
<li>C++ doens't have a convenient syntax for function application
as ML-based languages like Haskell and OCaml. So, multiple
function applications would be written as f1(f2(f3(f5 &#x2026; fn(x))))</li>

<li><span class="underline">Discoverability</span>: according to the presentation, IDE's may not
help to find them easily as they help to find methods (aka
member functions). However it can mitigated with careful
selection of namespaces which would improve code complexion
and discoverability.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
