Videos-and-conferences.html
<div id="outline-container-orgade1e1a" class="outline-4">
<h4 id="orgade1e1a"><span class="section-number-4">1.4.2</span> C++Now 2018: Ben Deane "Easy to Use, Hard to Misuse: Declarative Style in C++"</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=2ouxETt75R4">C++Now 2018: Ben Deane “Easy to Use, Hard to Misuse: Declarative Style in C++” - YouTube</a>
<ul class="org-ul">
<li>We say that interfaces should be easy to use and hard to
misuse. But how do we get there? In this talk I will demonstrate
how using declarative techniques in APIs, functions, and plain
old "regular" code can help. We'll look at what is meant by
"declarative style" in C++; explore why declarative interfaces
are desirable and how to construct them; and take an in-depth
look at which features of C++ help us write in a declarative
style. I want to deconstruct C++ a bit, examine what we're doing
and what makes the good parts good, and from that reconstruct
some best practices. Many of us are already writing code
following piecemeal modern advice such as "no raw loops", or
"almost always auto", or C++ core guideline recommendations. In
many cases, this advice translates to writing more declarative
code; being deliberate about exploring and using declarative
techniques gives us insight we can apply more widely.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7796df0" class="outline-3">
<h3 id="org7796df0"><span class="section-number-3">1.5</span> Tooling</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org876a193" class="outline-4">
<h4 id="org876a193"><span class="section-number-4">1.5.1</span> LVM Euro Conference 2013 - The Clang AST - a Tutorial</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=VqCkCDFLSsc">The Clang AST - a Tutorial - YouTube</a>
<ul class="org-ul">
<li>"If you always wanted to know more about about Clang's AST [1],
for example because you want to implement an awesome tool [2, 3]
based on Clang, or simply because you want to start contributing,
this talk is for you."</li>
<li>Note: Clang + LLVM suite provides many services that can be used
to build code automation tools for C++ such as code generators
and reflection metadata code generator.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org147d333" class="outline-4">
<h4 id="org147d333"><span class="section-number-4">1.5.2</span> CppCon 2018: "Latest and Greatest in the Visual Studio Family for C++ Developers 2018"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tooling">tooling</span></span></h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=6NAAuxWNhk4&amp;feature=youtu.be">CppCon 2018: “Latest and Greatest in the Visual Studio Family for C++ Developers 2018” - YouTube</a>
<ul class="org-ul">
<li>"This talk will be modeled on our previously successful talks at
CppCon. We'll give the community an update on how we are doing
in terms of conformance where we'll be announcing the final
conformance state for MSVC for the final 2017 update. We'll be
showing many many demos of new features (not in previous
versions of this talk) that target cross platform developers in
C++. This will include making it easier to bring your code to
Visual Studio, significant improvements to ease of use for
developers using CMake, improvements to unit testing
experiences, a lot of new Linux targeting improvements, an
update on our performance work, and new debugger features for
C++ developers. Developers will learn new tricks they can apply
immediately on leaving the session as well as get a sense of
what is coming in future updates. The main message is that
Visual Studio and Visual Studio Code will make every C++
developer (not just Windows developers) more productive."</li>
</ul></li>

<li>Features:

<ul class="org-ul">
<li>Fredom to target any platform from a single ID:
<ul class="org-ul">
<li>ARM/mBed, Android, Cyngwin, iOS, Linux, UWP, Windows</li>
</ul></li>

<li>CMake compatibility</li>

<li>The VC++ Compiler has full support for C++11/14/15 language features.

<ul class="org-ul">
<li>Process Snapshot - allows to introspect process memory.</li>

<li>Macro expansion - The editor, now can expand macros when the
mouse is hoovered over some macro.</li>

<li>Completion for templates.</li>

<li>Live Sharing =&gt; Collaboration session.</li>

<li>Multiple cursor editing, aka multi caret editing: hold CTRL +
ALT and click at the points where the cursor will be placed
and then type.</li>

<li>Peek definition.</li>

<li>Compiler flags:
<ul class="org-ul">
<li>/std:c++14 (default)</li>
<li>/std:c++17</li>
<li>/std:c++latest</li>
<li>/experimental:external  - Switch to isolate code from
external headers.</li>
</ul></li>

<li>C++ Core Check - <a href="https:/aka.ms/CppCoreCheck">https:/aka.ms/CppCoreCheck</a></li>
</ul></li>

<li>Integratio with other building systems: Make, Ninja, NMake, &#x2026;</li>

<li>Code editing experience:
<ul class="org-ul">
<li>IntelliSense =&gt; Smart Code Completion</li>
<li>Refactoring</li>
<li>Debugging</li>
<li>Reverse Debugging</li>
<li>Debug Visualization</li>
</ul></li>

<li>Integration with other compilers and tools:
<ul class="org-ul">
<li>Clang/LLVM, GCC, Clang-format, Google-test, Boost.Test</li>
</ul></li>

<li>Recommended Package Manger: <b>Vcpakge</b> - cross platform package
manager which works on Linux, MacOSX and Windows. There are over
900 libraries available in that.

<ul class="org-ul">
<li>$ vcpackage install boost sdl zlib gtest</li>
<li><a href="https://aka.ms/vcpkg">https://aka.ms/vcpkg</a></li>
</ul></li>

<li>Can compile and run code in remote machines and also perform
remote debugging.</li>

<li>One of the most valued and loved of feature of Visual Studio is
the <b>debugger</b>.
<ul class="org-ul">
<li>The debugger can attach to process in current or remote
machine through SSH.</li>
</ul></li>

<li><b>CMake target view</b> provides a CMake-centric experience showing
all targets, files and configuration.</li>

<li><b>Open folder experience:</b>
<ul class="org-ul">
<li>Optmized for non-MSBuild projects =&gt; any project using CMake,
make or other C++ building system. Target Windows, MinGW,
Cyngwin, Linux or mBed.</li>
<li>Easy to get started
<ul class="org-ul">
<li>devenv.exe &lt;folder&gt;</li>
<li>File =&gt; Open =&gt; Folder &#x2026; (Ctrl + Alt +Shift + O)</li>
</ul></li>
</ul></li>

<li>Linux Targeting:
<ul class="org-ul">
<li>Visual Studio can connect to any linux distribution with
GDB or GdbServer. Remove VMs, Containers, IoT (RasberryPI, Beaglebone),
Local Windows Subsystem for Linux distros and Cross-Compile.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb490a08" class="outline-4">
<h4 id="orgb490a08"><span class="section-number-4">1.5.3</span> Rapid Prototyping in C++ - Dmitri Nesteruk - Meeting C++ 2015</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=Ncy4Y-k-vLA">Rapid Prototyping in C++ - Dmitri Nesteruk - Meeting C++ 2015 - YouTube</a>
<ul class="org-ul">
<li>Description: Show several techniques for fast prototyping in C++.</li>
<li>Summary:
<ul class="org-ul">
<li>CERN's ROOT Framework or CLING C++ interpreter. Allows to play
and evaluate C++ code in the same fashion Python interpreter does.</li>
<li>Wrap the C++ library with SWIG wrapper generator to generate a Python binding and
then prototype in the Python REPL.</li>
<li>Use a more suitable tool with fast feedback for prototyping
such as spreadsheet, R language, Python, Matlab, Octave and so
on.</li>
<li>Runtime compiled C++.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
