Videos-and-conferences.html
<div id="outline-container-orgd806481" class="outline-4">
<h4 id="orgd806481"><span class="section-number-4">1.5.4</span> CppCon 2018: Steven Simpson "Source Instrumentation for Monitoring C++ in Production"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tooling">tooling</span>&#xa0;<span class="instrumentation">instrumentation</span></span></h4>
<div class="outline-text-4" id="text-1-5-4">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=0WgC5jnrRx8&amp;feature=youtu.be">CppCon 2018: Steven Simpson “Source Instrumentation for Monitoring C++ in Production” - YouTube</a>
<ul class="org-ul">
<li>"It is essential to discuss how modern C++ code can be
effectively instrumented, in order to effectively monitor it
after deployment. <b>This talk will focus on portable source</b>
<b>instrumentation techniques such as logging, tracing and</b>
<b>metrics</b>. Straightforward, but well designed code additions can
drastically ease the troubleshooting of functional issues, and
identification of performance bottlenecks, in production.  Of
course when dealing with C++ performance is often critical, and
so minimizing the cost of any instrumentation is also
critical. Key to this is understanding the trade-off between the
detail of information collected, and the overheads of exposing
that information. It is also important to understand how best to
benefit from advances in contemporary monitoring infrastructure,
popularised by "cloud" environments.  This talk will open with a
brief summary of monitoring goals, infrastructure, benefits, and
existing practise. It will then detail practicalities of building
a set of C++ source instrumentation primitives, based on proven
principles employed in demanding production software."</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Summary + Notes + Brainstorm:
<ul class="org-ul">
<li>Use a logging library with the following features.
<ul class="org-ul">
<li>Format string (or ostream)</li>
<li>Serverity levels, [INFO], [WARNING], [FAILURE], [CRITICAL], [TRACE] &#x2026;</li>
<li>Enable/disable at runtime</li>
<li>Logs files + rotation</li>
<li>Timestamp</li>
<li>Remote Logging</li>
<li>OS Integration =&gt; Syslog on U*nix, or OutputDebugString on Windows.</li>
</ul></li>

<li>Error messages and exception should have context about the
problem such as the file where it happened, code line, what
caused the exception and so on.</li>

<li>Log Service infrastructure:
<ul class="org-ul">
<li>Should support search, indexing, sorting and filtering.</li>
<li>Structured Logging Format: json, csv, to avoid parsing and
writing complicated regular expressions.</li>
<li>Logging Alert</li>
<li>Logging can be stored in cloud services.</li>
</ul></li>

<li>Logging X Tracing

<ul class="org-ul">
<li>A more detailed logging, showing the internals of some
operation for debugging purposes.</li>

<li>Example about tracing: Unix utility strace which log system
calls perfomed by a program. $ strace -ttT cat hello.txt</li>
</ul></li>

<li>Downsides of logging:
<ul class="org-ul">
<li>Logging may, specially writing to IO, may cause performance
overhead on performance critical code. This is why tracing
logging in this type of code is often disabled on deployment
builds.</li>
<li>Tracing can be implemented with C-preprocessor macros in
order to allow disabling it on debug builds. Using
preprocessor has also the advatange that, when the tracing is
disabled, it will not inccur on any rutime overhead or
performance cost, as string concatenation will not happen and
the code will be discarded.</li>
</ul></li>

<li>Domains where logging is essential:
<ul class="org-ul">
<li><span class="underline">Network Servers and Web Servers</span>. =&gt; Servers are long running
programs which runs in background as daemons without any
graphical user interface. So logging, is the only available
information about what is going on with the sefver.</li>
<li><span class="underline">Databases</span></li>
<li><span class="underline">Embedded Systems</span> =&gt; Usually doesn't have keyboard, monitor
and etc.</li>
<li><span class="underline">Industrial Instrumentation</span> =&gt; Temperature, pressure, speed, &#x2026;</li>
</ul></li>

<li>Closing:
<ul class="org-ul">
<li>By building observable software, the software can become its
own debugger.</li>
</ul></li>

<li><b>Techniques for Program Instrumentation</b> =&gt; My Ideas.
<ul class="org-ul">
<li>Logging with some logging library</li>
<li>Debug Build 
<ul class="org-ul">
<li>Debugging Symbols</li>
<li>Assertions =&gt; Allows to check assumptions during the
development.</li>
<li>Tracing</li>
</ul></li>
<li>Use a proper debugger such as GDB, WindBG, LLDB for
instrospecting the process.</li>
<li>Proper error messages with enough context information.</li>
<li>Unit Tests or some automated testing.</li>
<li>System call logger such as strace.</li>
<li>Memory Leak Detector such as Valgrind.</li>
<li>Profiler =&gt; Mesure performance.</li>
<li>Compiler with non cryptic error messages like Clang++.</li>
<li>Enforce as much correctness as possible at compile-time in
order to catch bugs earlier before runtime and deployment.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org62515a7" class="outline-3">
<h3 id="org62515a7"><span class="section-number-3">1.6</span> High Performance Computing for Math</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org394633d" class="outline-4">
<h4 id="org394633d"><span class="section-number-4">1.6.1</span> CPPCON 2016: Klaus Iglberger "The Blaze High Performance Math Library"</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=w-Y22KrMgFE">CppCon 2016: Klaus Iglberger “The Blaze High Performance Math Library" - YouTube</a>
<ul class="org-ul">
<li>"In this presentation we introduce the Blaze C++ math library, a
hot contender for the linear algebra performance throne. Blaze
is an open-source, high-performance library for dense and sparse
arithmetic. It combines elegance and ease of use with HPC-grade
performance, making it one of the most intuitive and at the same
time fastest C++ math libraries available. We demonstrate its
basic linear algebra functionality by means of several BLAS
level 1 to 3 operations and explain why Blaze outperforms even
well established linear algebra libraries. Additionally, we
present some advanced features that enable users to adapt Blaze
to special circumstances: custom data structures, custom
operations, and the customizable error reporting mechanism."

<ul class="org-ul">
<li>Note: Blaze library uses <span class="underline">Express Template</span> technique for
compile-time generation of high-performance linear algebra
code.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1d06b8" class="outline-4">
<h4 id="orgd1d06b8"><span class="section-number-4">1.6.2</span> Statistical scientific programming OO patterns: accumulators - Olivia Quinet - Lightning Talks&#xa0;&#xa0;&#xa0;<span class="tag"><span class="math">math</span>&#xa0;<span class="science">science</span></span></h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=IwvA7oExmSo">Statistical scientific programming OO patterns: accumulators - Olivia Quinet - Lightning Talks - YouTube</a>
<ul class="org-ul">
<li>"Statistical scientific programming OO patterns: accumulators -
Olivia Quinet - Lightning Talks Meeting C++ 2017"
<ul class="org-ul">
<li>Summary: Accumulators like Boost.Accumulators allows to compute
several statistical properties of a set of values such as a
time series avoiding errors such as <span class="underline">float pointing</span>
<span class="underline">castastrophic cancellation</span> and loss of precision. The Welford
statistical formula is shown as a way to implement accumulators
and how it can be used to compute standard deviation and other
statistical properties.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
