Videos-and-conferences.html
<div id="outline-container-orgc84625d" class="outline-4">
<h4 id="orgc84625d"><span class="section-number-4">1.6.3</span> Algorithms and Iterators for Multidimensional Arrays - Cem Bassoy - Lightning Talks Meeting C++ 2017&#xa0;&#xa0;&#xa0;<span class="tag"><span class="math">math</span>&#xa0;<span class="science">science</span></span></h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=8P-sDH9XJAc">Algorithms and Iterators for Multidimensional Arrays - Cem Bassoy - Lightning Talks Meeting C++ 2017 - YouTube</a></li>
</ul>

<p>
Paper at:  <a href="https://arxiv.org/abs/1711.10912">1711.10912 - TLib: A Flexible C++ Tensor Framework for Numerical Tensor Calculus</a>
</p>

<p>
Abstract:
</p>

<blockquote>
<p>
Numerical tensor calculus comprise basic tensor operations such as the
entrywise addition and contraction of higher-order tensors. We
present, TLib, flexible tensor framework with generic tensor functions
and tensor classes that assists users to implement generic and
flexible tensor algorithms in C++. The number of dimensions, the
extents of the dimensions of the tensors and the contraction modes of
the tensor operations can be runtime variable. Our framework provides
tensor classes that simplify the management of multidimensional data
and utilization of tensor operations using object-oriented and generic
programming techniques. Additional stream classes help the user to
verify and compare of numerical results with MATLAB. Tensor operations
are implemented with generic tensor functions and in terms of
multidimensional iterator types only, decoupling data storage
representation and computation. The user can combine tensor functions
with different tensor types and extend the framework without further
modification of the classes or functions. We discuss the design and
implementation of the framework and demonstrate its usage with
examples that have been discussed in the literature.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org27a0de5" class="outline-3">
<h3 id="org27a0de5"><span class="section-number-3">1.7</span> C++ Binary Components + ABI + Reflection</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgd0b63fc" class="outline-4">
<h4 id="orgd0b63fc"><span class="section-number-4">1.7.1</span> CPPCON 2016 - C++14 Reflections Without Macros, Markup nor External Tooling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="reflection">reflection</span>&#xa0;<span class="metaprogramming">metaprogramming</span>&#xa0;<span class="templates">templates</span></span></h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=abdeAew3gmQ">CppCon 2016: "C++14 Reflections Without Macros, Markup nor External Tooling.." - YouTube</a>
<ul class="org-ul">
<li>"C++ was lacking the reflections feature for a long time. But a
new metaprogramming trick was discovered recently: we can get
some information about POD structure by probing it's braced
initializes. Combining that trick with variadic templates,
constexpr functions, implicit conversion operators, SFINAE,
decltype and integral constants we can count structure's fields
and even deduce type of each field.  Now the best part:
everything works without any additional markup nor macros
typically needed to implement reflections in C++.  In this talk
I'll explain most of the tricks in detail, starting from a very
basic implementation that is only capable of detecting fields
count and ending up with a fully functional prototype capable of
dealing with nested PODs, const/volatile qualified pointers,
pointers-to-pointers and enum members. Highly useful use-cases
will be shown a the end of the talk. You may start experimenting
right now using the implementation at".</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga92f175" class="outline-4">
<h4 id="orga92f175"><span class="section-number-4">1.7.2</span> NDC Conference - Introduction to C++ Template Metaprogramming - Sasha Goldshtein&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tmp">tmp</span>&#xa0;<span class="templates">templates</span></span></h4>
<div class="outline-text-4" id="text-1-7-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=lrziylOWBT4">Introduction to C++ Template Metaprogramming - Sasha Goldshtein</a>
<ul class="org-ul">
<li>"technique in modern C++. First, TMP can be used as a precursor
to C++17 Concepts, in order to check constraints and produce
clear error messages when a template parameter doesn't adhere to
its specified constraints. Second, TMP can be used to pick an
algorithm implementation based on the template type provided &#x2013;
thus enabling optimizations for specific types. Finally, TMP can
be used to introspect C++ types at compile-time and generate
compile-time constructs that save time or enable
fully-compile-time computation. In this talk, we will review a
collection of techniques and examples for using TMP in your
libraries and application code. You are expected to understand
basic template syntax and template specialisation, and we will
build the rest as we go along."</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org81b75bc" class="outline-4">
<h4 id="org81b75bc"><span class="section-number-4">1.7.3</span> CppCon 2018: Victor Ciura "These Aren't the COM Objects You're Looking For"</h4>
<div class="outline-text-4" id="text-1-7-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=T_1zutIBHs0">CppCon 2018: Victor Ciura “These Aren't the COM Objects You're Looking For” - YouTube</a>
<ul class="org-ul">
<li>Description: "Windows COM is 25 years old. Yet it is relevant
today more than ever, because Microsoft has bet its entire
modern WinRT API on it (starting with Windows 8/10). But, if
you’re familiar with the “old” COM with its idioms and SDK
helper classes, you’re in for a treat. With the advent of modern
C++ 17, using COM objects and new Windows APIs in your
applications feels like a completely new experience. In this
session, we’ll explore how using modern C++ features can
radically transform the shape of your COM code. By eliminating a
lot of boilerplate, your code will be much more readable and
maintainable. Classic COM idioms around activation and
QueryInterface() can feel totally different with modern C++
helpers. A beautiful example of modern COM usage is C++/WinRT
(now part of Windows SDK). This is a standard C++ language
projection for the new Windows Runtime API.  COM memory
management, data marshalling, string handling can all feel quite
mechanical in nature and very error prone, so a little help from
modern C++ facilities would be more than welcomed. Error
handling and debugging can be cumbersome for COM like APIs;
we’ll explore some tricks to improve this experience, as well."</li>
</ul></li>
</ul>
</div>
</div>
