Videos-and-conferences.html
<div id="outline-container-org880e6f5" class="outline-4">
<h4 id="org880e6f5"><span class="section-number-4">1.7.4</span> BoostCon: John Bandela - Easy Binary Compatible C++ Interfaces Across Compilers</h4>
<div class="outline-text-4" id="text-1-7-4">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=BbbqBJ94-_E">John Bandela: Easy Binary Compatible C++ Interfaces Across Compilers - YouTube</a>
<ul class="org-ul">
<li>Description: C++ is often perceived as hard to use and not as
productive as other languages. One of the reasons for this is
the lack of interoperability of binary components. When using a
library, the user then either has to build from source (further
complicated by the fact that there are multiple build systems)
or the creator has to distribute multiple binaries. For example
on Windows, one may have to distribute binaries for GCC Mingw,
Visual C++ 2010 (release and debug, static and dynamic CRT),
Visual C++ 2012, etc. There have been attempts to get around
this problem. Options range from "extern C" functions, COM or
XPCOM, or language extensions such as C++/CX. The above options
either require compiler extensions or feel foreign and low-level
to someone who is used to Modern C++. With C++11 being more
consistently implemented across more compilers, one can take
advantage of features such as lambdas and variadic templates to
create easy to define, use, and implement binary interfaces that
will work across compilers.
<ul class="org-ul">
<li>This presentation will discuss the design and implementation of
a library that has the following benefits:</li>
<li>No external tools to run
<ul class="org-ul">
<li>Define an interface once and use the definition for both implementation and usage</li>
<li>Interfaces are easy to implement and use once defined</li>
<li>Use std::string, std::vector, and std::pair in the interface</li>
<li>Use real return types (not error codes)</li>
<li>Use exceptions both in implementation and usage</li>
<li>Binary compatible with COM</li>
<li>Supports interface inheritance</li>
<li>Supports implementation inheritance</li>
<li>Implementation tested on Windows with Visual C++ executable and GCC .dll</li>
<li>Implementation tested on Linux with GCC executable and Clang .so</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org93b90e1" class="outline-4">
<h4 id="org93b90e1"><span class="section-number-4">1.7.5</span> BoostCon: John Bandela - CppComponents- A Modern Portable C++11 Component System</h4>
<div class="outline-text-4" id="text-1-7-5">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=a4iFJuNBx7U">CppComponents- A Modern Portable C++11 Component System - YouTube</a></li>
</ul>
</div>
</div>

<div id="outline-container-org40442c7" class="outline-4">
<h4 id="org40442c7"><span class="section-number-4">1.7.6</span> CppCon 2017: Mathieu Ropert "API &amp; ABI Versioning"</h4>
<div class="outline-text-4" id="text-1-7-6">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=Ia3IDPjA-d0">CppCon 2017: Mathieu Ropert “API &amp; ABI Versioning&#x2026;” - YouTube</a>
<ul class="org-ul">
<li>"Software keeps changing, but not always as fast as its
clients. A key to maintaining a library in the long run is to
ensure a proper versioning of the API and ABI. Not only does this
gives a clear picture of both source and binary compatibility
between the versions, but it also helps design by making breaking
changes explicit to the developer.  In this talk I will define
API and ABI in terms of impacts on compatibility, explain the
difference between breaking and non-breaking changes and present
a few techniques to handle them.  We will quickly explain what
APIs are, with an emphasis on the notion of contracts. Then the
usually lesser known notion of ABI will be explained, going over
the concepts of call syntax, mangling and most importantly sizes,
alignment and offsets in data structures. We will see how to use
semantic versioning (semver) in C++ by considering not only
changes to the API but also to the ABI and offer some advice on
how to change API and ABI over time and how to minimize the
impacts."</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-12-06 Thu 01:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
